# -*- coding: utf-8 -*-
# @Author: leonliang
# @Date:   2018-03-26 15:16:42
# @Last Modified by:   leonliang
# @Last Modified time: 2018-03-28 10:37:51
import time
import re
import json
import toolkits


class my_class(object):
    pass


# 启动符'@@' 2字节,数据包的第一、二字节,为固定值64,64(十进制)--40,40(十六进制)
PackageBeginStr = "4040"
# 结束符'##' 2字节,数据包的最后两个字节,为固定值35,35(十进制)--23,23(十六进制)
PackageEndStr = "2323"

'''通讯方式: 
控制命令为"01"(十进制),01(十六进制)---(监控中心->用户信息传输装置:监控中心--控制命令-->用户信息传输装置--确认-->监控中心);
信息上传为"05"(十进制),05(十六进制)---(用户信息传输装置->监控中心:用户信息传输装置--信息上传-->监控中心--接收确认-->用户信息传输装置);
信息查询为"10"(十进制),0A(十六进制)---(监控中心->用户信息传输装置:监控中心--信息查询请求-->用户信息传输装置--应答-->监控中心);
'''
CommandsTypes = ["01", "05", "10"]

# VerificationFlag确认校验是否通过,如果所有校验规则通过后无问题,则VerificationFlag为true,VerificationCode数组中存在唯一字符串"200"
VerificationCode = {
    "200": "发送包数据,已经通过校验位验证,验证正确",
    "500": "发送包数据,未能通过校验位,可能是通讯中发生了意味[应对:1,重试;2,报错-提醒线路巡检]",

    "301": "启动符,信息1,2两位不是固定值64(十进制),40(十六进制)",
    "305": "结束符,信息最末两位不是固定值35(十进制),23(十六进制)",

    "501": "发送标记时间与当前系统事件相距10秒以上,请确认应用时钟同步状态或者确认数据是否重发(国家标准超时时间不宜大于10秒)",
    "601": "平台该标识信息已经接受3次以上,请确认应用时钟同步状态或者确认相关应用响应确认服务是否正常(国家标准超时重发不宜大于3次)"
}


'''传输包数据定义区域 Region Begin'''
# 传输包结构定义,数据定义方式Json,具体定义为"起始位置|结束位置"2字节,数据包的第一、二字节,为固定值64,64(十进制)--40,40(十六进制)
APPDataStruct = {
    "ID" = "6.6",
    "BeginStr": "0|2",  # 启动符'@@' 2字节,数据包的第一、二字节,为固定值64H,64H(十进制)--40,40(十六进制)
    "BNoLowbit": "2|3",  # 业务流水号低字节 1字节,低字节
    "BNoHighbit": "3|4",  # 业务流水号高字节 1字节,高字节
    "BNoOrigion": "2|4",  # 业务流水号原始值 2字节,低字节先传高字节后传
    # 业务流水号 2字节,BNo = BNoHighbit+BNoLowbit
    "BNoOrigion": "command:BNoHighbit+BNoLowbit",
    "MasterProtocolVer": "4|5",  # 协议版本主版本号 1字节
    "UserProtocolVer": "5|6",  # 协议版本用户版本号 1字节
    "ProtocolVer": "4|6",  # 协议版本 1字节
    "SendDate": "6|12",  # 时间标签6个字节,低字节先传,即秒,分,时,月,日,年(年为两位,如2018标识为18)
    "SendTimeSec": "6|7",  # 发送秒 1个字节
    "SendTimeMin": "7|8",  # 发送分 1个字节
    "SendTimeHour": "8|9",  # 发送小时 1个字节
    "SendTimedate": "9|10",  # 发送日 1个字节
    "SendTimeMonth": "10|11",  # 发送月 1个字节
    "SendTimeYear": "11|12",  # 发送年 1个字节
    # 上行方向,从用户信息传输装置到监控中心的数据传输方向,需要区分
    # 下行方向,从监控中心到用户信息传输装饰的数据传输方向,需要区分
    "OriginalAddr": "12|18",  # 源地址 6个字节
    "DestinationAddr": "18|24",  # 目的地址 6个字节
    "AppDataLengthlowbit": "24|25",  # 应用数据单元长度低字节  1字节
    "AppDataLengthHighbit": "25|26",  # 应用数据单元长度高字节 1字节
    # 应用数据单元长度高字节 1字节
    "AppDataLength": "command:int(AppDataLengthHighbit+AppDataLengthlowbit,16)",
    "AppData": "27|command:27+AppDataLength",  # 应用数据 共AppDataLength长度个字节
    "Command": "26|27",  # 命令字节 1字节

    "Checksum": "-3|-2",  # 校验和 1位 使用各位和校验和求反方式, 倒数第三位
    "EndStr": "-2|"  # 结束符'##' 2字节,数据包的倒数第一、二字节,为固定值35H,35H(十进制)--23,23(十六进制)
}


'''传输包数据定义区域 Region End'''

'''应用数据定义区域 Region Begin'''
# 应用数据结构定义,数据定义方式Json,具体定义为
CommandTypeStruct = {
    # 命令字节
    "00": "预留",
    "01": "控制命令",
    "02": "发送数据",
    "03": "确认",
    "04": "请求",
    "05": "应答",
    "06": "否认"
    # 07-127---预留
    # 128-255---用户自行定义
}


# 数据类型标志含义,数据定义方式Json,具体定义见国标26875.3-2011的"表3"
JsonAppTypeFlag = {
    "1":  "1, #上传建筑消防设施系统状态",
    "2":  "2, #上传建筑消防设施部件运行状态",
    "3":  "3, #上传建筑消防设施部件模拟量值",
    "4":  "4, #上传建筑消防设施操作信息",
    "5":  "5, #上传建筑消防设施软件版本",
    "6":  "6, #上传建筑消防设施系统配置情况",
    "7":  "7, #上传建筑消防设施部件配置情况",
    "8":  "8, #上传建筑消防设施系统时间",
    "21":  "21, #上传用户信息传输装置运行状态",
    "24":  "24, #上传用户信息传输装置操作信息",
    "25":  "25, #上传用户信息传输装置软件版本",
    "26":  "26, #上传用户信息传输装置配置情况",
    "28":  "28, #上传用户信息传输装置系统时间",
    "61":  "61, #读建筑消防设施系统状态",
    "62":  "62, #读建筑消防设施部件运行状态",
    "63":  "63, #读建筑消防设施部件模拟量值",
    "64":  "64, #读建筑消防设施操作信息",
    "65":  "65, #读建筑消防设施软件版本",
    "66":  "66, #读建筑消防设施系统配置情况",
    "67":  "67, #读建筑消防设施部件配置情况",
    "68":  "68, #读建筑消防设施系统时间",
    "81":  "82, #读用户信息传输装备运行状态",
    "84":  "84, #读用户信息传输装置操作信息记录",
    "85":  "85, #读用户信息传输装置软件版本",
    "86":  "86, #读用户信息传输装置配置情况",
    "88":  "88, #读用户信息传输装置系统时间",
    "89":  "89, #初始化用户信息传输装置",
    "90":  "90, #同步用户信息传输装置时钟",
    "91":  "92, #查岗命令"
}

# 数据类型标志索引含义,数据定义方式Json,具体定义对应APPDataStruct.AppObjBodyLength定义配置内容索引
JsonAppTypeFlagIndex = {
    "1":  0,  # 上传建筑消防设施系统状态
    "2":  1,  # 上传建筑消防设施部件运行状态
    "3":  2,  # 上传建筑消防设施部件模拟量值
    "4":  3,  # 上传建筑消防设施操作信息
    "5":  4,  # 上传建筑消防设施软件版本
    "6":  5,  # 上传建筑消防设施系统配置情况
    "7":  6,  # 上传建筑消防设施部件配置情况
    "8":  7,  # 上传建筑消防设施系统时间
    "21":  8,  # 上传用户信息传输装置运行状态
    "24":  9,  # 上传用户信息传输装置操作信息
    "25":  10,  # 上传用户信息传输装置软件版本
    "26":  11,  # 上传用户信息传输装置配置情况
    "28":  12,  # 上传用户信息传输装置系统时间
    "61":  13,  # 读建筑消防设施系统状态
    "62":  14,  # 读建筑消防设施部件运行状态
    "63":  15,  # 读建筑消防设施部件模拟量值
    "64":  16,  # 读建筑消防设施操作信息
    "65":  17,  # 读建筑消防设施软件版本
    "66":  18,  # 读建筑消防设施系统配置情况
    "67":  19,  # 读建筑消防设施部件配置情况
    "68":  20,  # 读建筑消防设施系统时间
    "81":  21,  # 读用户信息传输装备运行状态
    "84":  22,  # 读用户信息传输装置操作信息记录
    "85":  23,  # 读用户信息传输装置软件版本
    "86":  24,  # 读用户信息传输装置配置情况
    "88":  25,  # 读用户信息传输装置系统时间
    "89":  26,  # 初始化用户信息传输装置
    "90":  27,  # 同步用户信息传输装置时钟
    "91":  28,  # 查岗命令"
}

# 系统类型定义表,数据定义方式Json,具体定义见国标26875.3-2011的表4
JsonAppSysType = {
    "0": "通用",
    "1": "火灾报警系统",
    # "2-9" : "预留",
    "10": "消防联动控制器",
    "11": "消火栓系统",
    "12": "自动喷水灭火系统",
    "13": "气体灭火系统",
    "14": "水喷雾灭火系统(泵启动方式)",
    "15": "水喷雾灭火系统(压力容器启动方式)",
    "16": "泡沫灭火系统",
    "17": "干粉灭火系统",
    "18": "防烟排烟系统",
    "19": "防火门急卷帘系统",
    "20": "消防电梯",
    "21": "消防应急广播",
    "22": "消防应用照明和疏散指示系统",
    "23": "消防电源",
    "24": "消防电话"  # ,
    # "25-127" : "预留",
    # "128-255" : "用户自定义"
}
