# -*- coding: utf-8 -*-
# @Author: leonliang
# @Date:   2018-05-26 15:16:42
# @Last Modified by:   leonliang
# @Last Modified time: 2018-05-28 11:23:10
# 完成国标数据字典映射工作<GB／T 268753—2011>
import time
import re
import json
import toolkits

'''通用字典区域 Region Begin'''
#VerificationFlag确认校验是否通过,如果所有校验规则通过后无问题,则VerificationFlag为true,VerificationCode数组中存在唯一字符串"200"

DictVerificationCode = {
	"200" : "发送包数据,已经通过校验位验证,验证正确",
	"500" : "发送包数据,未能通过校验位,可能是通讯中发生了意味[应对:1,重试;2,报错-提醒线路巡检]",

	"301" : "启动符,信息1,2两位不是固定值64(十进制),40(十六进制)",
	"305" : "结束符,信息最末两位不是固定值35(十进制),23(十六进制)",
	
	"501" : "发送标记时间与当前系统事件相距10秒以上,请确认应用时钟同步状态或者确认数据是否重发(国家标准超时时间不宜大于10秒)",
	"601" : "平台该标识信息已经接受3次以上,请确认应用时钟同步状态或者确认相关应用响应确认服务是否正常(国家标准超时重发不宜大于3次)"
}

#命令字节含义,数据定义方式字典, 具体定义见国标26875.3-2011的"表2"

DictCommandTypeStruct ={
	#命令字节
    "00":"预留" ,
    "01":"控制命令" ,
    "02":"发送数据" ,
    "03":"确认" ,
    "04":"请求" ,
    "05":"应答" ,
    "06":"否认" 
    #07-127---预留
	#128-255---用户自行定义
}

#上行方向,从用户信息传输装置到监控中心的数据传输方向
upperActions = ["02","04"]
#下行方向,从监控中心到用户信息传输装饰的数据传输方向										
downActions =  ["01","03","04","05"]

#数据类型标志含义,数据定义方式字典,具体定义见国标26875.3-2011的"表3"
DictAppTypeFlag = {
	"1" :  "上传建筑消防设施系统状态",
	"2" :  "上传建筑消防设施部件运行状态",  
	"3" :  "上传建筑消防设施部件模拟量值",
	"4" :  "上传建筑消防设施操作信息",
	"5" :  "上传建筑消防设施软件版本",
	"6" :  "上传建筑消防设施系统配置情况",
	"7" :  "上传建筑消防设施部件配置情况",
	"8" :  "上传建筑消防设施系统时间",
	"21" :  "上传用户信息传输装置运行状态",
	"24" :  "上传用户信息传输装置操作信息",
	"25" :  "上传用户信息传输装置软件版本",
	"26" :  "上传用户信息传输装置配置情况",
	"28" :  "上传用户信息传输装置系统时间",
	"61" :  "读建筑消防设施系统状态",
	"62" :  "读建筑消防设施部件运行状态",
	"63" :  "读建筑消防设施部件模拟量值",
	"64" :  "读建筑消防设施操作信息",
	"65" :  "读建筑消防设施软件版本",
	"66" :  "读建筑消防设施系统配置情况",
	"67" :  "读建筑消防设施部件配置情况",
	"68" :  "读建筑消防设施系统时间",
	"81" :  "读用户信息传输装备运行状态",
	"84" :  "读用户信息传输装置操作信息记录",
	"85" :  "读用户信息传输装置软件版本",
	"86" :  "读用户信息传输装置配置情况",
	"88" :  "读用户信息传输装置系统时间",
	"89" :  "初始化用户信息传输装置",
	"90" :  "同步用户信息传输装置时钟",
	"91" :  "查岗命令"
}

#系统类型定义表,数据定义方式字典,具体定义见国标26875.3-2011的表4
DictAppSysType ={
	"0" : "通用",
	"1" : "火灾报警系统",
	#"2-9" : "预留",
	"10" : "消防联动控制器",
	"11" : "消火栓系统",
	"12" : "自动喷水灭火系统",
	"13" : "气体灭火系统",
	"14" : "水喷雾灭火系统(泵启动方式)",
	"15" : "水喷雾灭火系统(压力容器启动方式)",
	"16" : "泡沫灭火系统",
	"17" : "干粉灭火系统",
	"18" : "防烟排烟系统",
	"19" : "防火门急卷帘系统",
	"20" : "消防电梯",
	"21" : "消防应急广播",
	"22" : "消防应用照明和疏散指示系统",
	"23" : "消防电源",
	"24" : "消防电话" #,
	#"25-127" : "预留",
	#"128-255" : "用户自定义"
}

#建筑消防设施部件类型定义表,数据定义方式字典,具体定义见国标26875.3-2011的表5
DictAppPartType ={
	"0" : "通用",
	"1" : "火灾报警控制器",
	#"2-9" : "预留",
	"10" : "可燃气体探测器",
	"11" : "点型可燃气体探测器",
	"12" : "独立式可燃气体探测器",
	"13" : "线型可燃气探测器",
	#"14" : "预留",
	#"15" : "预留",
	"16" : "电器火灾监控报警器",
	"17" : "剩余电流式电气火灾监控探测器",
	"18" : "测温式电气火灾监控探测器",
	#"19" : "预留",
	#"20" : "预留",
	"21" : "探测回路",
	"22" : "火灾显示盘",
	"23" : "手动火灾报警按钮",
	"24" : "消防栓按钮", 
	"25" : "火灾探测器",
	#"26-29" : "预留",
	"30" : "感温火灾探测器",
	"31" : "点型感温火灾探测器",
	"32" : "点型感温火灾探测器(S型)",
	"33" : "点型感温火灾探测器(R型)",
	"34" : "线型感温火灾探测器",
	"35" : "线型感温火灾探测器(S型)",
	"36" : "线型感温火灾探测器(R型)",
	"37" : "光纤感温火灾探测器",
	#"38" : "预留",
	#"39" : "预留",
	"40" : "感烟火灾探测器",
	"41" : "点型离子感烟火灾探测器",
	"42" : "点型光电感烟火灾探测器",
	"43" : "线型光束感烟火灾探测器",
	"44" : "吸气式感烟火灾探测器", 	
	#"45-49" : "预留",
	"50" : "复合式火灾探测器",
	"51" : "复合式感烟感温火灾探测器",
	"52" : "复合式感光感温火灾探浏器",
	"53" : "复合式感光感烟火灾探测器",
	#"54-59" : "预留",
	#"60" : "预留",
	"61" : "紫外火焰探测器",
	"62" : "红外火焰探测器",
	#"63-68" : "预留",
	"69" : "感光火灾探测器",
	#"70-73" : "预留",
	"74" : "气体探测器",
	#"75-77" : "预留",
	"78" : "图像摄像方式火灾探测器",
	"79" : "感声火灾探测器",
	#"80" : "预留",
	"81" : "气体灭火控制器",
	"82" : "消防电气控制装置",
	"83" : "消防控制室图形显示装置",
	"84" : "模块",
	"85" : "输入模块",
	"86" : "输出模块",
	"87" : "输入／输出模块",
	"88" : "中继模块",
	#"89-90" : "预留",
	"91" : "消防水泵",
	"92" : "消防水箱",
	#"93" : "预留",
	#"94" : "预留",
	"95" : "喷淋泵",
	"96" : "水流指示器",
	"97" : "信号阀",
	"98" : "报警阀",
	"99" : "压力开关",
	#"100" : "预留",
	"101" : "阀驱动装置",
	"102" : "防火门",
	"103" : "防火阀",
	"104" : "通风空调",
	"105" : "泡沫液泵",
	"106" : "管网电磁阀",
	#"107-110" : "预留",
	"111" : "防烟排烟风机",
	#"112" : "预留",
	"113" : "排烟防火阀",
	"114" : "常闭送风口",
	"115" : "排烟口",
	"116" : "电控挡烟垂壁",
	"117" : "防火卷帘控制器",
	"118" : "防火门监控器",
	#"119-120" : "预留",
	"121" : "警报装置" #,
	#"121-127" : "预留",
	#"128-255" : "用户自定义"

}
#模拟量类型和模拟量值的具体定义表,数据定义方式字典,具体定义见国标26875.3-2011的表6 Begin
DictAnalogQuantityType = {
    "1" : "事件计数",
    "2" : "高度",
    "3" : "湿度",
    "4" : "压力(兆帕)",
    "5" : "压力(千帕)",
    "6" : "气体浓度",
    "7" : "时间",
    "8" : "电压",
    "9" : "电流",
    "10" : "流量",
    "11" : "风量",
    "12" : "风速"
}

DictAnalogQuantityUnit = {
    "1" : "件",
    "2" : "m",
    "3" : "摄氏度",
    "4" : "MPa(兆帕)",
    "5" : "kPa(千帕)",
    "6" : "%LEL",
    "7" : "s",
    "8" : "V",
    "9" : "A",
    "10" : "L/s",
    "11" : "㎡/Min(平方米/秒)",
    "12" : "m/s"
}

DictAnalogQuantityLowValue = {
    "1" : 0,
    "2" : 0,
    "3" : -273,
    "4" : 0,
    "5" : 0,
    "6" : 0,
    "7" : 0,
    "8" : 0,
    "9" : 0,
    "10" : 0,
    "11" : 0,
    "12" : 0
}

DictAnalogQuantityHighValue = {
    "1" : 32000,
    "2" : 320,
    "3" : 3200,
    "4" : 3200,
    "5" : 3200,
    "6" : 100,
    "7" : 32000,
    "8" : 3200,
    "9" : 3200,
    "10" : 3200,
    "11" : 3200,
    "12" : 20
}

DictAnalogQuantityMiniUnit = {
    "1" : "1件",
    "2" : "0.01m",
    "3" : "0.1摄氏度",
    "4" : "0.1MPa(兆帕)",
    "5" : "0.1kPa(千帕)",
    "6" : "0.1%LEL",
    "7" : "1s",
    "8" : "0.1V",
    "9" : "0.1A",
    "10" : "0.1L/s",
    "11" : "0.1㎡/Min(平方米/秒)",
    "12" : "0.1m/s"
}

#模拟量类型和模拟量值的具体定义表,数据定义方式字典,具体定义见国标26875.3-2011的表6 End



#
#
'''通用字典区域 End Begin'''

'''应用数据定义区域 Region Begin'''
#应用数据结构定义,数据定义方式Dict,具体定义为
DictCommandTypeStruct ={
	#命令字节
    "00":"预留" ,
    "01":"控制命令" ,
    "02":"发送数据" ,
    "03":"确认" ,
    "04":"请求" ,
    "05":"应答" ,
    "06":"否认" 
    #07-127---预留
	#128-255---用户自行定义
}



#数据类型标志含义,数据定义方式Dict字典,具体定义见国标26875.3-2011的"表3"
DictAppTypeFlag = {
	"1" :  "1, #上传建筑消防设施系统状态",
	"2" :  "2, #上传建筑消防设施部件运行状态",  
	"3" :  "3, #上传建筑消防设施部件模拟量值",
	"4" :  "4, #上传建筑消防设施操作信息",
	"5" :  "5, #上传建筑消防设施软件版本",
	"6" :  "6, #上传建筑消防设施系统配置情况",
	"7" :  "7, #上传建筑消防设施部件配置情况",
	"8" :  "8, #上传建筑消防设施系统时间",
	"21" :  "21, #上传用户信息传输装置运行状态",
	"24" :  "24, #上传用户信息传输装置操作信息",
	"25" :  "25, #上传用户信息传输装置软件版本",
	"26" :  "26, #上传用户信息传输装置配置情况",
	"28" :  "28, #上传用户信息传输装置系统时间",
	"61" :  "61, #读建筑消防设施系统状态",
	"62" :  "62, #读建筑消防设施部件运行状态",
	"63" :  "63, #读建筑消防设施部件模拟量值",
	"64" :  "64, #读建筑消防设施操作信息",
	"65" :  "65, #读建筑消防设施软件版本",
	"66" :  "66, #读建筑消防设施系统配置情况",
	"67" :  "67, #读建筑消防设施部件配置情况",
	"68" :  "68, #读建筑消防设施系统时间",
	"81" :  "82, #读用户信息传输装备运行状态",
	"84" :  "84, #读用户信息传输装置操作信息记录",
	"85" :  "85, #读用户信息传输装置软件版本",
	"86" :  "86, #读用户信息传输装置配置情况",
	"88" :  "88, #读用户信息传输装置系统时间",
	"89" :  "89, #初始化用户信息传输装置",
	"90" :  "90, #同步用户信息传输装置时钟",
	"91" :  "92, #查岗命令"
}

#数据类型标志索引含义,数据定义方式Dict字典,具体定义对应APPDataStruct.AppObjBodyLength定义配置内容索引
DictAppTypeFlagIndex = {
	"1" :  0, #上传建筑消防设施系统状态
	"2" :  1, #上传建筑消防设施部件运行状态  
	"3" :  2, #上传建筑消防设施部件模拟量值
	"4" :  3, #上传建筑消防设施操作信息
	"5" :  4, #上传建筑消防设施软件版本
	"6" :  5, #上传建筑消防设施系统配置情况
	"7" :  6, #上传建筑消防设施部件配置情况
	"8" :  7, #上传建筑消防设施系统时间
	"21" :  8, #上传用户信息传输装置运行状态
	"24" :  9, #上传用户信息传输装置操作信息
	"25" :  10, #上传用户信息传输装置软件版本
	"26" :  11, #上传用户信息传输装置配置情况
	"28" :  12, #上传用户信息传输装置系统时间
	"61" :  13, #读建筑消防设施系统状态
	"62" :  14, #读建筑消防设施部件运行状态
	"63" :  15, #读建筑消防设施部件模拟量值
	"64" :  16, #读建筑消防设施操作信息
	"65" :  17, #读建筑消防设施软件版本
	"66" :  18, #读建筑消防设施系统配置情况
	"67" :  19, #读建筑消防设施部件配置情况
	"68" :  20, #读建筑消防设施系统时间
	"81" :  21, #读用户信息传输装备运行状态
	"84" :  22, #读用户信息传输装置操作信息记录
	"85" :  23, #读用户信息传输装置软件版本
	"86" :  24, #读用户信息传输装置配置情况
	"88" :  25, #读用户信息传输装置系统时间
	"89" :  26, #初始化用户信息传输装置
	"90" :  27, #同步用户信息传输装置时钟
	"91" :  28, #查岗命令"
}

#系统类型定义表,数据定义方式Dict字典,具体定义见国标26875.3-2011的表4
DictAppSysType ={
	"0" : "通用",
	"1" : "火灾报警系统",
	#"2-9" : "预留",
	"10" : "消防联动控制器",
	"11" : "消火栓系统",
	"12" : "自动喷水灭火系统",
	"13" : "气体灭火系统",
	"14" : "水喷雾灭火系统(泵启动方式)",
	"15" : "水喷雾灭火系统(压力容器启动方式)",
	"16" : "泡沫灭火系统",
	"17" : "干粉灭火系统",
	"18" : "防烟排烟系统",
	"19" : "防火门急卷帘系统",
	"20" : "消防电梯",
	"21" : "消防应急广播",
	"22" : "消防应用照明和疏散指示系统",
	"23" : "消防电源",
	"24" : "消防电话" #,
	#"25-127" : "预留",
	#"128-255" : "用户自定义"
}
