# -*- coding: utf-8 -*-
# @Author: leonliang
# @Date:   2018-05-26 15:16:42
# @Last Modified by:   leonliang
# @Last Modified time: 2018-05-28 11:23:10
# 完成国标数据字典映射工作<GB／T 268753—2011>
import time
import re
import json
import toolkits

'''通用字典区域 Region Begin'''
#命令字节含义,数据定义方式字典, 具体定义见国标26875.3-2011的"表2"
DictCommandTypeStruct ={
	#命令字节
    "00":"预留" ,
    "01":"控制命令" ,
    "02":"发送数据" ,
    "03":"确认" ,
    "04":"请求" ,
    "05":"应答" ,
    "06":"否认" 
    #07-127---预留
	#128-255---用户自行定义
}

#上行方向,从用户信息传输装置到监控中心的数据传输方向
upperActions = ["02","04"]
#下行方向,从监控中心到用户信息传输装饰的数据传输方向										
downActions =  ["01","03","04","05"]

#数据类型标志含义,数据定义方式字典,具体定义见国标26875.3-2011的"表3"
DictAppTypeFlag = {
	"1" :  "上传建筑消防设施系统状态",
	"2" :  "上传建筑消防设施部件运行状态",  
	"3" :  "上传建筑消防设施部件模拟量值",
	"4" :  "上传建筑消防设施操作信息",
	"5" :  "上传建筑消防设施软件版本",
	"6" :  "上传建筑消防设施系统配置情况",
	"7" :  "上传建筑消防设施部件配置情况",
	"8" :  "上传建筑消防设施系统时间",
	"21" :  "上传用户信息传输装置运行状态",
	"24" :  "上传用户信息传输装置操作信息",
	"25" :  "上传用户信息传输装置软件版本",
	"26" :  "上传用户信息传输装置配置情况",
	"28" :  "上传用户信息传输装置系统时间",
	"61" :  "读建筑消防设施系统状态",
	"62" :  "读建筑消防设施部件运行状态",
	"63" :  "读建筑消防设施部件模拟量值",
	"64" :  "读建筑消防设施操作信息",
	"65" :  "读建筑消防设施软件版本",
	"66" :  "读建筑消防设施系统配置情况",
	"67" :  "读建筑消防设施部件配置情况",
	"68" :  "读建筑消防设施系统时间",
	"81" :  "读用户信息传输装备运行状态",
	"84" :  "读用户信息传输装置操作信息记录",
	"85" :  "读用户信息传输装置软件版本",
	"86" :  "读用户信息传输装置配置情况",
	"88" :  "读用户信息传输装置系统时间",
	"89" :  "初始化用户信息传输装置",
	"90" :  "同步用户信息传输装置时钟",
	"91" :  "查岗命令"
}

#系统类型定义表,数据定义方式字典,具体定义见国标26875.3-2011的表4
JsonAppSysType ={
	"0" : "通用",
	"1" : "火灾报警系统",
	#"2-9" : "预留",
	"10" : "消防联动控制器",
	"11" : "消火栓系统",
	"12" : "自动喷水灭火系统",
	"13" : "气体灭火系统",
	"14" : "水喷雾灭火系统(泵启动方式)",
	"15" : "水喷雾灭火系统(压力容器启动方式)",
	"16" : "泡沫灭火系统",
	"17" : "干粉灭火系统",
	"18" : "防烟排烟系统",
	"19" : "防火门急卷帘系统",
	"20" : "消防电梯",
	"21" : "消防应急广播",
	"22" : "消防应用照明和疏散指示系统",
	"23" : "消防电源",
	"24" : "消防电话" #,
	#"25-127" : "预留",
	#"128-255" : "用户自定义"
}

#建筑消防设施部件类型定义表,数据定义方式字典,具体定义见国标26875.3-2011的表5
DictAppPartType ={
	"0" : "通用",
	"1" : "火灾报警控制器",
	#"2-9" : "预留",
	"10" : "可燃气体探测器",
	"11" : "点型可燃气体探测器",
	"12" : "独立式可燃气体探测器",
	"13" : "线型可燃气探测器",
	#"14" : "预留",
	#"15" : "预留",
	"16" : "电器火灾监控报警器",
	"17" : "剩余电流式电气火灾监控探测器",
	"18" : "测温式电气火灾监控探测器",
	#"19" : "预留",
	#"20" : "预留",
	"21" : "探测回路",
	"22" : "火灾显示盘",
	"23" : "手动火灾报警按钮",
	"24" : "消防栓按钮", 
	"25" : "火灾探测器",
	#"26-29" : "预留",
	"30" : "感温火灾探测器",
	"31" : "点型感温火灾探测器",
	"32" : "点型感温火灾探测器(S型)",
	"33" : "点型感温火灾探测器(R型)",
	"34" : "线型感温火灾探测器",
	"35" : "线型感温火灾探测器(S型)",
	"36" : "线型感温火灾探测器(R型)",
	"37" : "光纤感温火灾探测器",
	#"38" : "预留",
	#"39" : "预留",
	"40" : "感烟火灾探测器",
	"41" : "点型离子感烟火灾探测器",
	"42" : "点型光电感烟火灾探测器",
	"43" : "线型光束感烟火灾探测器",
	"44" : "吸气式感烟火灾探测器", 	
	#"45-49" : "预留",
	"50" : "复合式火灾探测器",
	"51" : "复合式感烟感温火灾探测器",
	"52" : "复合式感光感温火灾探浏器",
	"53" : "复合式感光感烟火灾探测器",
	#"54-59" : "预留",
	#"60" : "预留",
	"61" : "紫外火焰探测器",
	"62" : "红外火焰探测器",
	#"63-68" : "预留",
	"69" : "感光火灾探测器",
	#"70-73" : "预留",
	"74" : "气体探测器",
	#"75-77" : "预留",
	"78" : "图像摄像方式火灾探测器",
	"79" : "感声火灾探测器",
	#"80" : "预留",
	"81" : "气体灭火控制器",
	"82" : "消防电气控制装置",
	"83" : "消防控制室图形显示装置",
	"84" : "模块",
	"85" : "输入模块",
	"86" : "输出模块",
	"87" : "输入／输出模块",
	"88" : "中继模块",
	#"89-90" : "预留",
	"91" : "消防水泵",
	"92" : "消防水箱",
	#"93" : "预留",
	#"94" : "预留",
	"95" : "喷淋泵",
	"96" : "水流指示器",
	"97" : "信号阀",
	"98" : "报警阀",
	"99" : "压力开关",
	#"100" : "预留",
	"101" : "阀驱动装置",
	"102" : "防火门",
	"103" : "防火阀",
	"104" : "通风空调",
	"105" : "泡沫液泵",
	"106" : "管网电磁阀",
	#"107-110" : "预留",
	"111" : "防烟排烟风机",
	#"112" : "预留",
	"113" : "排烟防火阀",
	"114" : "常闭送风口",
	"115" : "排烟口",
	"116" : "电控挡烟垂壁",
	"117" : "防火卷帘控制器",
	"118" : "防火门监控器",
	#"119-120" : "预留",
	"121" : "警报装置" #,
	#"121-127" : "预留",
	#"128-255" : "用户自定义"

}
#模拟量类型和模拟量值的具体定义表,数据定义方式字典,具体定义见国标26875.3-2011的表6 Begin
DictAnalogQuantityType = {
    "1" : "事件计数",
    "2" : "高度",
    "3" : "湿度",
    "4" : "压力(兆帕)",
    "5" : "压力(千帕)",
    "6" : "气体浓度",
    "7" : "时间",
    "8" : "电压",
    "9" : "电流",
    "10" : "流量",
    "11" : "风量",
    "12" : "风速"
}

DictAnalogQuantityUnit = {
    "1" : "件",
    "2" : "m",
    "3" : "摄氏度",
    "4" : "MPa(兆帕)",
    "5" : "kPa(千帕)",
    "6" : "%LEL",
    "7" : "s",
    "8" : "V",
    "9" : "A",
    "10" : "L/s",
    "11" : "㎡/Min(平方米/秒)",
    "12" : "m/s"
}

DictAnalogQuantityLowValue = {
    "1" : 0,
    "2" : 0,
    "3" : -273,
    "4" : 0,
    "5" : 0,
    "6" : 0,
    "7" : 0,
    "8" : 0,
    "9" : 0,
    "10" : 0,
    "11" : 0,
    "12" : 0
}

DictAnalogQuantityHighValue = {
    "1" : 32000,
    "2" : 320,
    "3" : 3200,
    "4" : 3200,
    "5" : 3200,
    "6" : 100,
    "7" : 32000,
    "8" : 3200,
    "9" : 3200,
    "10" : 3200,
    "11" : 3200,
    "12" : 20
}

DictAnalogQuantityMiniUnit = {
    "1" : "1件",
    "2" : "0.01m",
    "3" : "0.1摄氏度",
    "4" : "0.1MPa(兆帕)",
    "5" : "0.1kPa(千帕)",
    "6" : "0.1%LEL",
    "7" : "1s",
    "8" : "0.1V",
    "9" : "0.1A",
    "10" : "0.1L/s",
    "11" : "0.1㎡/Min(平方米/秒)",
    "12" : "0.1m/s"
}

#模拟量类型和模拟量值的具体定义表,数据定义方式字典,具体定义见国标26875.3-2011的表6 End


"""
报警类型
"""
alarmType={1:"火警",2:"故障",3:"其它"}
alarmCategory={
    1:"手动报火警",
    2:"自动报火警",
    3:"通讯故障",
    4:"部位故障",
    5:"电源故障",
    6:"系统故障",
    7:"探测总线故障",
    8:"触点故障",
    9:"其它"
    }
alarmProcess={1:"真火警",
    2:"假火警（火警手动消除）",
    3:"维保测试（火警手动消除）",
    4:"火警自动消除",
    5:"故障自动消除",
    6:"报警待处理",
    7:"故障已处理",
    8:"其它"}

alarmInform = { 
    1:"通知维保",
    2:"通知消防部门和值班人员",
    3:"其它"
    }

AlarmInfo = {"Type":alarmType,"Category":alarmCategory,"Process":alarmProcess,"Inform":alarmInform}


maintenanceCategory = {1:"维保巡查",2:"维保维修",3:"其它"}
maintenanceRepairCategory = {1:"维保更换",2:"维保修理",3:"其它"}
MaintenanceInfo = {"Category":maintenanceCategory,"RepairCategory":maintenanceRepairCategory}

usageType={1:'商场/市场:"宾馆/饭店:"体育场/馆:"会堂、公共娱乐场所/娱乐、游戏、网吧、酒吧等:"公共服务场所/健身、洗浴等公众聚集场所',
  2:"医院、养老院和寄宿制学校、托儿所、幼儿园",
  3:"国家机关",
  4:"广播电台、电视台和邮政、通信枢纽",
5:"客运车站、码头、民用机场、机动车地下停车场、机动车公共停车楼",
6:"公共图书馆、展览馆、博物馆、档案馆以及具有火灾危险性的文物保护单位",
7:"发电厂（站）和电网经营企业",
8:"易燃易爆化学物品的生产、充装、储存、供应、销售单位",
9:"服装、制鞋等劳动密集型生产、加工企业和具有火灾危险性的工矿业、制造业、食品药品生产加工业、运输业等企业的生产经营场所",
10:"重要的科研单位",
11:"其它发生火灾可能性较大以及一旦发生火灾可能造成人身重大伤亡或者财产损失的单位、现场、建筑等"}

fireproofingDegree = {
  1:"重点",
2:"非重点",
3:"其它"}

ConnectNetworkUserInfo = {"Type":userType,"Degree":fireproofingDegree}


builderType = {
    1:"厂房（仓库）",
    2:"甲、乙、丙类液体、气体储罐（区）与可燃材料堆场",
    3:"9层及9层以下居住建筑",
    4:"小于等于24m的公共建筑、大于24m的单层公共建筑、地下半地下建筑",
    5:"城市交通隧道",
    6:"高层建筑",
    7:"其它"}

highbuildType = {
    1:"一类",
    2:"二类",
    3:"其它"
    } 
builderfireproofingDegree = {
    1:"一级",
    2:"二级",
    3:"三级",
    4:"四级",
    5:"其它"
  } 

riskDegree = {
    1:"轻危险级",
    2:"中危险级一级",
    3:"中危险级二级",
    4:"严重危险级一级",
    5:"严重危险级二级",
    6:"其它"}
 
builderStruct = {
    1:"砖混结构",
    2:"浇筑结构",
    3:"其它"}

BuilderInfo = {"builderType":builderType,"highbuildType":highbuildType,"builderfireproofingDegree":builderfireproofingDegree,"riskDegree":riskDegree,
"builderStruct":builderStruct}

firedeviceCategory = {
    1:"报警设施",
    2:"灭火设施",
    3:"防护设施",
    4:"其它"
}

firedeviceStatus = {
    1:"不正常",
    2:"正常",
    3:"已停用",
    4:"其它"
}

firedeviceType = {
    1:"点型定温火灾探测器",
    2:"点型差温火灾探测器",
    3:"点型差定温火灾探测器",
    4:"线型定温火灾探测器",
    5:"线型差温火灾探测器",
    6:"线型差定温火灾探测器",
    7:"光纤感温火灾探测器",
    8:"其它感温火灾探测器",
    9:"点型离子感烟火灾探测器",
    10:"点型光电感烟火灾探测器",
    11:"其它感烟火灾探测器",
    12:"复合式感烟感温火灾探测器",
    13:"复合式感光感温火灾探测器",
    14:"复合式感光感烟火灾探测器",
    15:"其它复合式火灾探测器",
    16:"紫外火焰探测器",
    17:"红外火焰探测器",
    18:"红紫外复合火焰探测器",
    19:"其它感光火灾探测器",
    20:"其它火灾探测器",
    21:"可燃气体探测器",
    22:"手动火灾报警按钮",
    23:"区域火灾报警控制器",
    24:"集中火灾报警控制器",
    25:"CRT报警显示系统",
    26:"火灾广播与通讯系统、",
    27:"音响灯光报警装置",
    28:"其它火灾报警设备",
    29:"建筑灭火器",
    30:"自动喷水灭火系统",
    31:"卤代烷固定灭火系统",
    32:"气体灭火系统",
    33:"泡沫灭火系统",
    34:"干粉固定灭火系统",
    35:"消火栓给水灭火系统",
    36:"其它灭火设备",
    37:"防火门与防火卷帘",
    38:"消防电梯",
    39:"其它辅助灭火设备",
    40:"防、排烟系统",
    41:"通风、空调系统",
    42:"人员防护设备",
    43:"其它防护设备"
}

FireDeviceInfo = {"firedeviceCategory":firedeviceCategory,"firedeviceStatus":firedeviceStatus,"firedeviceType":firedeviceType}

pollingmethod = {
    1:"巡检",
    2:"自检",
    3:"其它",
}

inspectresult = {
    1:"正常",
    2:"不正常",
    3:"其它"
}

SystemRunStatusInfo = {"pollingmethod":pollingmethod,"inspectresult":inspectresult}

communicationtype = {
    1:"ADSL",
    2:"双音频",
    3:"光纤",
    4:"组合",
    5:"其它"
}

communicationmethod = {
    1:"有线",
    2:"无线",
    3:"组合",
    4:"其它"
}
commnuicationnettype = {
    1:"专用网",
    2:"公用网",
    3:"组合",
    4:"其它"
}

backuppower = {
    1:"有",
    2:"无",
    3:"其它"
}

SupervisionCenterInfo = {"communicationtype":communicationtype,"communicationmethod":communicationmethod,"commnuicationnettype":commnuicationnettype,"backuppower":backuppower}

InspectSentry = {1:"在岗",2:"离岗",3:"其它"}


inspectmethod = {
    1:"主动巡检方式",
    2:"被动巡检方式",
    3:"不巡检",
    4:"其它"
}
backupobject = {
    1:"数据库",
    2:"设置信息",
    3:"用户信息",
    4:"地图",
    5:"其它"
}
backupmethod = {
    1:"差分备份",
    2:"增量备份",
    3:"全部备份",
    4:"其它"
}
SystemMaintenceInfo = {"inspectmethod":inspectmethod,"backupobject":backupobject,"backupmethod":backupmethod}


userright = {
    1:"读权限",
    2:"写权限",
    3:"完全控制",
    4:"其它"
}

SecurityInfo = {"userright":userright}

maptype = {
    1:"矢量地图",
    2:"点阵地图",
    3:"其它"
}

abarbeitung = {
    1:"完成",
    2:"未完成",
    3:"其它"
}
AbarbeitungInfo = {"abarbeitung":abarbeitung}

#
#
'''通用字典区域 End Begin'''