#!/usr/bin/env python
# -*- coding=utf-8 -*-
import struct

"""
报警类型
"""
alarmType={1:"火警",2:"故障",3:"其它",}
alarmCategory={
    1:"手动报火警",
    2:"自动报火警",
    3:"通讯故障",
    4:"部位故障",
    5:"电源故障",
    6:"系统故障",
    7:"探测总线故障",
    8:"触点故障",
    9:"其它",
    }
alarmProcess={1:"真火警",
    2:"假火警（火警手动消除）",
    3:"维保测试（火警手动消除）",
    4:"火警自动消除",
    5:"故障自动消除",
    6:"报警待处理",
    7:"故障已处理",
    8:"其它",}

alarmInform = { 
    1:"通知维保",
    2:"通知消防部门和值班人员",
    3:"其它",
    }

AlarmInfo = {"Type":alarmType,"Category":alarmCategory,"Process":alarmProcess,"Inform":alarmInform}


maintenanceCategory = {1:"维保巡查",2:"维保维修",3:"其它",}
maintenanceRepairCategory = {1:"维保更换",2:"维保修理",3:"其它",}
MaintenanceInfo = {"Category":maintenanceCategory,"RepairCategory":maintenanceRepairCategory}

userType={1:'商场（市场:"宾馆（饭店:"体育场（馆:"会堂、公共娱乐场所（娱乐、游戏、网吧、酒吧等:"公共服务场所（健身、洗浴等）等公众聚集场所',
  2:"医院、养老院和寄宿制学校、托儿所、幼儿园",
  3:"国家机关",
  4:"广播电台、电视台和邮政、通信枢纽",
5:"客运车站、码头、民用机场、机动车地下停车场、机动车公共停车楼",
6:"公共图书馆、展览馆、博物馆、档案馆以及具有火灾危险性的文物保护单位",
7:"发电厂（站）和电网经营企业",
8:"易燃易爆化学物品的生产、充装、储存、供应、销售单位",
9:"服装、制鞋等劳动密集型生产、加工企业和具有火灾危险性的工矿业、制造业、食品药品生产加工业、运输业等企业的生产经营场所",
10:"重要的科研单位",
11:"其它发生火灾可能性较大以及一旦发生火灾可能造成人身重大伤亡或者财产损失的单位、现场、建筑等",}

fireproofingDegree = {
  1:"重点",
2:"非重点",
3:"其它",}

ConnectNetworkUserInfo = {"Type":userType,"Degree":fireproofingDegree}


builderType = {
    1:"厂房（仓库）",
    2:"甲、乙、丙类液体、气体储罐（区）与可燃材料堆场",
    3:"9层及9层以下居住建筑",
    4:"小于等于24m的公共建筑、大于24m的单层公共建筑、地下半地下建筑",
    5:"城市交通隧道",
    6:"高层建筑",
    7:"其它",}

highbuildType = {
    1:"一类",
    2:"二类",
    3:"其它",
    } 
builderfireproofingDegree = {
    1:"一级",
    2:"二级",
    3:"三级",
    4:"四级",
    5:"其它",
  } 

riskDegree = {
    1:"轻危险级",
    2:"中危险级一级",
    3:"中危险级二级",
    4:"严重危险级一级",
    5:"严重危险级二级",
    6:"其它",}
 
builderStruct = {
    1:"砖混结构",
    2:"浇筑结构",
    3:"其它",}

BuilderInfo = {"builderType":builderType,"highbuildType":highbuildType,"builderfireproofingDegree":builderfireproofingDegree,"riskDegree":riskDegree,
"builderStruct":builderStruct}

firedeviceCategory = {
    1:"报警设施",
    2:"灭火设施",
    3:"防护设施",
    4:"其它",
}

firedeviceStatus = {
    1:"不正常",
    2:"正常",
    3:"已停用",
    4:"其它",
}

firedeviceType = {
    1:"点型定温火灾探测器",
    2:"点型差温火灾探测器",
    3:"点型差定温火灾探测器",
    4:"线型定温火灾探测器",
    5:"线型差温火灾探测器",
    6:"线型差定温火灾探测器",
    7:"光纤感温火灾探测器",
    8:"其它感温火灾探测器",
    9:"点型离子感烟火灾探测器",
    10:"点型光电感烟火灾探测器",
    11:"其它感烟火灾探测器",
    12:"复合式感烟感温火灾探测器",
    13:"复合式感光感温火灾探测器",
    14:"复合式感光感烟火灾探测器",
    15:"其它复合式火灾探测器",
    16:"紫外火焰探测器",
    17:"红外火焰探测器",
    18:"红紫外复合火焰探测器",
    19:"其它感光火灾探测器",
    20:"其它火灾探测器",
    21:"可燃气体探测器",
    22:"手动火灾报警按钮",
    23:"区域火灾报警控制器",
    24:"集中火灾报警控制器",
    25:"CRT报警显示系统",
    26:"火灾广播与通讯系统、",
    27:"音响灯光报警装置",
    28:"其它火灾报警设备",
    29:"建筑灭火器",
    30:"自动喷水灭火系统",
    31:"卤代烷固定灭火系统",
    32:"气体灭火系统",
    33:"泡沫灭火系统",
    34:"干粉固定灭火系统",
    35:"消火栓给水灭火系统",
    36:"其它灭火设备",
    37:"防火门与防火卷帘",
    38:"消防电梯",
    39:"其它辅助灭火设备",
    40:"防、排烟系统",
    41:"通风、空调系统",
    42:"人员防护设备",
    43:"其它防护设备",
}

FireDeviceInfo = {"firedeviceCategory":firedeviceCategory,"firedeviceStatus":firedeviceStatus,"firedeviceType":firedeviceType}

pollingmethod = {
    1:"巡检",
    2:"自检",
    3:"其它",
}

inspectresult = {
    1:"正常",
    2:"不正常",
    3:"其它",
}

SystemRunStatusInfo = {"pollingmethod":pollingmethod,"inspectresult":inspectresult}

communicationtype = {
    1:"ADSL",
    2:"双音频",
    3:"光纤",
    4:"组合",
    5:"其它",
}

communicationmethod = {
    1:"有线",
    2:"无线",
    3:"组合",
    4:"其它",
}
commnuicationnettype = {
    1:"专用网",
    2:"公用网",
    3:"组合",
    4:"其它",
}

backuppower = {
    1:"有",
    2:"无",
    3:"其它",
}

SupervisionCenterInfo = {"communicationtype":communicationtype,"communicationmethod":communicationmethod,"commnuicationnettype":commnuicationnettype,"backuppower":backuppower}

InspectSentry = {1:"在岗",2:"离岗",3:"其它",}


inspectmethod = {
    1:"主动巡检方式",
    2:"被动巡检方式",
    3:"不巡检",
    4:"其它",
}
backupobject = {
    1:"数据库",
    2:"设置信息",
    3:"用户信息",
    4:"地图",
    5:"其它",
}
backupmethod = {
    1:"差分备份",
    2:"增量备份",
    3:"全部备份",
    4:"其它",
}
SystemMaintenceInfo = {"inspectmethod":inspectmethod,"backupobject":backupobject,"backupmethod":backupmethod}


userright = {
    1:"读权限",
    2:"写权限",
    3:"完全控制",
    4:"其它",
}

SecurityInfo = {"userright":userright}

maptype = {
    1:"矢量地图",
    2:"点阵地图",
    3:"其它",
}

abarbeitung = {
    1:"完成",
    2:"未完成",
    3:"其它",
}
AbarbeitungInfo = {"abarbeitung":abarbeitung}


#0D 10 12 34 56 78 90 12 01 00 00 00 09 01 01 00 00 00 00 00 00 00 D2 FF
def packageUpStream(): # eventType,PhoneNum,DeviceID,InfoFlag,MachineNo,Warning):
    #上行消息格式：24字节
    #起始符(1)+事件类型(1)+电话号码(6)+收发器ID(4)+信息标识(1)+机号(1)+报警信息(8) +校验和(1)+结束符(1)   
    """
    数据通信方式为消息方式，上行和下行消息格式不同。

    上行消息格式：24字节（现在不传输电话号码，应该只有18个字节）
    起始符(1)+事件类型(1)+电话号码(6)+收发器ID(4)+信息标识(1)+机号(1)+报警信息(8) +校验和(1)+结束符(1)
    例子：0D 10 00000001 10 01 0000000000000000 22 FF
    下行消息格式：24字节（现在不传输电话号码，应该只有18个字节）
    起始符(1)+事件类型(1)+电话号码(6)+收发器ID(4)+信息标识(1)+设置信息(9)+校验和(1)+结束符(1)

    定义：

    起始符：1字节
            0DH     上行数据
            0D0H    下行数据

    事件类型：1字节
            00H-0FH  保留
            10H      报警系统火警、故障（消防报警系统报警信息）
            20H      报警系统关机（消防报警系统关机）
            30H      应答信息
    31H      设置信息（对收发器进行设置）
    32H      读设置信息（读收发器的设置信息）是上行数据吗？如果是没有相应的请求事件？？？？
            40H      请求巡检(带收发器号，振铃次数2次就挂断)
            41H      查岗请求（问询联网用户是否在岗）
            42H      在岗信息（回应查岗请求）
    43H	  被巡检电话已振铃
            44H      巡检成功（由控制器段收发器发向监控中心）
            50H      维保信息（维保信息返回）
    60H      振铃信息（监管中心收发器发给监管PC来电信息）
    61H      连接接通（链路建立成功标识）
    62H      链路中断（链路中断标识）
    65H      线路繁忙（电话占线标识）
    66H      无信号音（电话线路无载波）
    70H-0EFH  保留
            0F0H     退出连接

    电话号码：6字节，带区号的电话号码信息。 以十六进制字符A为结束半字节

    收发器ID：4字节
            XXXXXXXXH
            包含区域代码和收发器序列号两部分。其中前2个字节为区域代码，后2个字节为收发器序列号。监控中心收发器的区域代码指定为0000H，其序列号规定范围为0000H到0010H，共计可组成17个ID。

    信息标识：可无，最大1字节，

    事件类型为10H时，09H为现场收发器的手动报警信息
    10H为现场收发器的触点报警信息
    11H为部位探测器报警信息
    12H为部位报警
    13H为部位报警已消除信息
    40H为触点故障信息
    48H为通讯故障信息
    50H为探测点或控制点有故障信息
    51H为探测点或控制点故障已消除信息
    52H为电源故障信息
    53H电源故障已消除信息
    54H为系统故障信息
    55H为系统故障已消除信息
    56H为探测总线故障信息
    57H为探测总线故障已消除信息
    95H为屏蔽的部位号信息
    96H为取消屏蔽的部位号信息
    9CH为设置屏蔽总线
    9DH为取消屏蔽总线

    事件类型为20H时，信息标识无

    事件类型为30H时，信息标识为10H表示失败请求重发信息。
    信息标识为11H表示成功信息
    信息标识为20H表示操作应答信息

    事件类型31H、32H时，
    信息标识为11H表示设置时 1 0X00-0X17
    信息标识为12H表示设置分 1 0X00-0X17
    信息标识为21H表示设置ID号 4
    信息标识为30H表示设置拨打电话最大数 1 0X00-0XFF
    信息标识为31H表示设置报警电话号码   6
    信息标识为32H表示设置巡检电话号码  6
    信息标识为41H表示设置触点优先 1 0X00-0X01
    信息标识为42H表示设置RS485总线优先 1 0X00-0X01
    信息标识为43H表示设置CAN总线优先1 0X00-0X01
    信息标识为51H表示设置主动巡检方式 1 0X01
    信息标识为52H表示设置被动巡检方式 1 0X02
    信息标识为53H表示设置不巡检1 0X00
                    信息标识为60H表示设置回铃音检测时间
                    信息标识为70H表示设置通讯波特率
    事件类型为40H、41H时，无信息标识

    事件类型为50H时，无信息标识

    事件类型为42H时，信息标识为11H表示人员在岗  -----为什么没有不在岗标识？？   

    事件类型为60H、61H、62H、65H、66H、0F0H时，无信息标识

    机号：可无，最大1字节
            发出报警信息的控制器编号，事件类型为10H时才有机号信息。

    报警信息：可无，可变字节，最大8字节
            包括报警信息的部位地址、类型、区号、工程地址等参数，事件类型为10H时才有参数信息。

    设置信息：可无，可变字节，最大8字节
            包括设置信息中的时间、号码等参数，特殊信息类型和信息标识无设置信息。

    校验和：1字节
    包信息校验字节，信息类型至设置信息数据求和，取低8位字节

    结束符：1字节
            0FFH

    """                                    
    #上行消息格式：24字节（现在不传输电话号码，应该只有18个字节）
    #起始符(1)+事件类型(1)+电话号码(6)+收发器ID(4)+信息标识(1)+机号(1)+报警信息(8) +校验和(1)+结束符(1)
    #例子：0D 10 00000001 10 01 0000000000000000 22 FF
    packMsgData = struct.pack('8B2H12B',0xd,0x10,12,34,56,0xAA,0xAA,0xAA,0x0100,0x0000,0x09,0x02,0x03,0,0,0,0,0,0,0x0,0xB9,0xff)
    binfile=open('d:\\upMsg_sample.dat','wb')
    binfile.write(packMsgData)
    binfile.close()

def packageUpStreamGB():
    #@@
    packMsgData = struct.pack('2B2H6B6B6BHB2B4B6B3B',64,64,0x0001,0x0201,20,25,13,24,11,17,0x00,0x50,0x56,0xc0,0x00,0x01,0x00,0x50,0x56,0xc0,0x00,0x08,0xC,0x2,0x1,0x1,116,101,115,116,10,11,15,24,11,17,0x55,35,35)
    binfile=open('d:\\GBupMsg_sample.dat','wb')
    binfile.write(packMsgData)
    binfile.close()


if __name__ == '__main__':
    #packageUpStream()
    packageUpStreamGB()
    